esmil/gd32vf103inator/include/gd32vf103/rcu.h
/*
 * Copyright (c) 2019, GigaDevice Semiconductor Inc.
 * Copyright (c) 2019, Emil Renner Berthing
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 */
#ifndef GD32VF103_RCU_H
#define GD32VF103_RCU_H

#include "gd32vf103.h"

#define RCU_BASE _AC(0x40021000,UL)  /*!< RCU base address */

/* register definitions */
#define RCU_CTL     _AC(0x00,UL) /*!< control register */
#define RCU_CFG0    _AC(0x04,UL) /*!< clock configuration register 0 */
#define RCU_INT     _AC(0x08,UL) /*!< clock interrupt register */
#define RCU_APB2RST _AC(0x0C,UL) /*!< APB2 reset register */
#define RCU_APB1RST _AC(0x10,UL) /*!< APB1 reset register */
#define RCU_AHBEN   _AC(0x14,UL) /*!< AHB1 enable register */
#define RCU_APB2EN  _AC(0x18,UL) /*!< APB2 enable register */
#define RCU_APB1EN  _AC(0x1C,UL) /*!< APB1 enable register */
#define RCU_BDCTL   _AC(0x20,UL) /*!< backup domain control register */
#define RCU_RSTSCK  _AC(0x24,UL) /*!< reset source / clock register */
#define RCU_AHBRST  _AC(0x28,UL) /*!< AHB reset register */
#define RCU_CFG1    _AC(0x2C,UL) /*!< clock configuration register 1 */
#define RCU_DSV     _AC(0x34,UL) /*!< deep-sleep mode voltage register */

/* RCU_CTL */
#define RCU_CTL_PLL2STB                _BIT(29,U)              /*!< PLL2 clock stabilization flag */
#define RCU_CTL_PLL2EN                 _BIT(28,U)              /*!< PLL2 enable */
#define RCU_CTL_PLL1STB                _BIT(27,U)              /*!< PLL1 clock stabilization flag */
#define RCU_CTL_PLL1EN                 _BIT(26,U)              /*!< PLL1 enable */
#define RCU_CTL_PLLSTB                 _BIT(25,U)              /*!< PLL clock stabilization flag */
#define RCU_CTL_PLLEN                  _BIT(24,U)              /*!< PLL enable */
#define RCU_CTL_CKMEN                  _BIT(19,U)              /*!< HXTAL clock monitor enable */
#define RCU_CTL_HXTALBPS               _BIT(18,U)              /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_HXTALSTB               _BIT(17,U)              /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALEN                _BIT(16,U)              /*!< external high speed oscillator enable */
#define RCU_CTL_IRC8MCALIB_Pos         8
#define RCU_CTL_IRC8MCALIB_Msk         _AC(0x0000ff00,U)       /*!< high speed internal oscillator calibration value register */
#define RCU_CTL_IRC8MCALIB(x)          ((x) << RCU_CTL_IRC8MCALIB_Pos)
#define RCU_CTL_IRC8MADJ_Pos           3
#define RCU_CTL_IRC8MADJ_Msk           _AC(0x000000f80,U)      /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL_IRC8MADJ(x)            ((x) << RCU_CTL_IRC8MADJ_Pos)
#define RCU_CTL_IRC8MSTB               _BIT(1,U)               /*!< IRC8M high speed internal oscillator stabilization flag */
#define RCU_CTL_IRC8MEN                _BIT(0,U)               /*!< internal high speed oscillator enable */

/* RCU_CFG0 */
#define RCU_CFG0_PLLMF_4_Pos           29
#define RCU_CFG0_PLLMF_4               _BIT(29,U)              /*!< bit 4 of PLLMF */
#define RCU_CFG0_ADCPSC_2_Pos          28
#define RCU_CFG0_ADCPSC_2              _BIT(28,U)              /*!< bit 2 of ADCPSC */
#define RCU_CFG0_CKOUT0SEL_Pos         24
#define RCU_CFG0_CKOUT0SEL_Msk         _AC(0x0f000000,U)       /*!< CKOUT0 clock source selection */
#define RCU_CFG0_CKOUT0SEL(x)          ((x) << RCU_CFG0_CKOUT0SEL_Pos)
#define RCU_CFG0_CKOUT0SEL_NONE        RCU_CFG0_CKOUT0SEL(0)   /*!< no clock selected */
#define RCU_CFG0_CKOUT0SEL_CKSYS       RCU_CFG0_CKOUT0SEL(4)   /*!< system clock selected */
#define RCU_CFG0_CKOUT0SEL_IRC8M       RCU_CFG0_CKOUT0SEL(5)   /*!< internal 8M RC oscillator clock selected */
#define RCU_CFG0_CKOUT0SEL_HXTAL       RCU_CFG0_CKOUT0SEL(6)   /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CFG0_CKOUT0SEL_CKPLL_DIV2  RCU_CFG0_CKOUT0SEL(7)   /*!< CK_PLL/2 clock selected */
#define RCU_CFG0_CKOUT0SEL_CKPLL1      RCU_CFG0_CKOUT0SEL(8)   /*!< CK_PLL1 clock selected */
#define RCU_CFG0_CKOUT0SEL_CKPLL2_DIV2 RCU_CFG0_CKOUT0SEL(9)   /*!< CK_PLL2/2 clock selected */
#define RCU_CFG0_CKOUT0SEL_EXT1        RCU_CFG0_CKOUT0SEL(10)  /*!< EXT1 selected */
#define RCU_CFG0_CKOUT0SEL_CKPLL2      RCU_CFG0_CKOUT0SEL(11)  /*!< CK_PLL2 clock selected */
#define RCU_CFG0_USBFSPSC_Pos          22
#define RCU_CFG0_USBFSPSC_Msk          _AC(0x00c00000,U)       /*!< USBFS clock prescaler selection */
#define RCU_CFG0_USBFSPSC(x)           ((x) << RCU_CFG0_USBFSPSC_Pos)
#define RCU_CFG0_USBFSPSC_DIV1_5       RCU_CFG0_USBFSPSC(0)    /*!< USBFS prescaler select CK_PLL/1.5 */
#define RCU_CFG0_USBFSPSC_DIV1         RCU_CFG0_USBFSPSC(1)    /*!< USBFS prescaler select CK_PLL/1 */
#define RCU_CFG0_USBFSPSC_DIV2_5       RCU_CFG0_USBFSPSC(2)    /*!< USBFS prescaler select CK_PLL/2.5 */
#define RCU_CFG0_USBFSPSC_DIV2         RCU_CFG0_USBFSPSC(3)    /*!< USBFS prescaler select CK_PLL/2 */
#define RCU_CFG0_PLLMF_Pos             18
#define RCU_CFG0_PLLMF_Msk             _AC(0x203c0000,U)       /*!< PLL clock multiplication factor */
#define RCU_CFG0_PLLMF(x)              ((((x) & _AC(0xf,U)) << RCU_CFG0_PLLMF_Pos) | (((x) >> 4) << RCU_CFG0_PLLMF_4_Pos))
#define RCU_CFG0_PLLMF_MUL2            RCU_CFG0_PLLMF(0)       /*!< PLL source clock multiply by 2 */
#define RCU_CFG0_PLLMF_MUL3            RCU_CFG0_PLLMF(1)       /*!< PLL source clock multiply by 3 */
#define RCU_CFG0_PLLMF_MUL4            RCU_CFG0_PLLMF(2)       /*!< PLL source clock multiply by 4 */
#define RCU_CFG0_PLLMF_MUL5            RCU_CFG0_PLLMF(3)       /*!< PLL source clock multiply by 5 */
#define RCU_CFG0_PLLMF_MUL6            RCU_CFG0_PLLMF(4)       /*!< PLL source clock multiply by 6 */
#define RCU_CFG0_PLLMF_MUL7            RCU_CFG0_PLLMF(5)       /*!< PLL source clock multiply by 7 */
#define RCU_CFG0_PLLMF_MUL8            RCU_CFG0_PLLMF(6)       /*!< PLL source clock multiply by 8 */
#define RCU_CFG0_PLLMF_MUL9            RCU_CFG0_PLLMF(7)       /*!< PLL source clock multiply by 9 */
#define RCU_CFG0_PLLMF_MUL10           RCU_CFG0_PLLMF(8)       /*!< PLL source clock multiply by 10 */
#define RCU_CFG0_PLLMF_MUL11           RCU_CFG0_PLLMF(9)       /*!< PLL source clock multiply by 11 */
#define RCU_CFG0_PLLMF_MUL12           RCU_CFG0_PLLMF(10)      /*!< PLL source clock multiply by 12 */
#define RCU_CFG0_PLLMF_MUL13           RCU_CFG0_PLLMF(11)      /*!< PLL source clock multiply by 13 */
#define RCU_CFG0_PLLMF_MUL14           RCU_CFG0_PLLMF(12)      /*!< PLL source clock multiply by 14 */
#define RCU_CFG0_PLLMF_MUL6_5          RCU_CFG0_PLLMF(13)      /*!< PLL source clock multiply by 6.5 */
#define RCU_CFG0_PLLMF_MUL16           RCU_CFG0_PLLMF(14)      /*!< PLL source clock multiply by 16 */
#define RCU_CFG0_PLLMF_MUL17           RCU_CFG0_PLLMF(16)      /*!< PLL source clock multiply by 17 */
#define RCU_CFG0_PLLMF_MUL18           RCU_CFG0_PLLMF(17)      /*!< PLL source clock multiply by 18 */
#define RCU_CFG0_PLLMF_MUL19           RCU_CFG0_PLLMF(18)      /*!< PLL source clock multiply by 19 */
#define RCU_CFG0_PLLMF_MUL20           RCU_CFG0_PLLMF(19)      /*!< PLL source clock multiply by 20 */
#define RCU_CFG0_PLLMF_MUL21           RCU_CFG0_PLLMF(20)      /*!< PLL source clock multiply by 21 */
#define RCU_CFG0_PLLMF_MUL22           RCU_CFG0_PLLMF(21)      /*!< PLL source clock multiply by 22 */
#define RCU_CFG0_PLLMF_MUL23           RCU_CFG0_PLLMF(22)      /*!< PLL source clock multiply by 23 */
#define RCU_CFG0_PLLMF_MUL24           RCU_CFG0_PLLMF(23)      /*!< PLL source clock multiply by 24 */
#define RCU_CFG0_PLLMF_MUL25           RCU_CFG0_PLLMF(24)      /*!< PLL source clock multiply by 25 */
#define RCU_CFG0_PLLMF_MUL26           RCU_CFG0_PLLMF(25)      /*!< PLL source clock multiply by 26 */
#define RCU_CFG0_PLLMF_MUL27           RCU_CFG0_PLLMF(26)      /*!< PLL source clock multiply by 27 */
#define RCU_CFG0_PLLMF_MUL28           RCU_CFG0_PLLMF(27)      /*!< PLL source clock multiply by 28 */
#define RCU_CFG0_PLLMF_MUL29           RCU_CFG0_PLLMF(28)      /*!< PLL source clock multiply by 29 */
#define RCU_CFG0_PLLMF_MUL30           RCU_CFG0_PLLMF(29)      /*!< PLL source clock multiply by 30 */
#define RCU_CFG0_PLLMF_MUL31           RCU_CFG0_PLLMF(30)      /*!< PLL source clock multiply by 31 */
#define RCU_CFG0_PLLMF_MUL32           RCU_CFG0_PLLMF(31)      /*!< PLL source clock multiply by 32 */
#define RCU_CFG0_PREDV0_LSB            _BIT(17,U)              /*!< the LSB of PREDV0 division factor */
#define RCU_CFG0_PLLSEL                _BIT(16,U)              /*!< PLL clock source selection */
#define RCU_CFG0_ADCPSC_Pos            14
#define RCU_CFG0_ADCPSC_Msk            _AC(0x1000c000,U)       /*!< ADC prescaler selection */
#define RCU_CFG0_ADCPSC(x)             ((((x) & _AC(0x3,U)) << RCU_CFG0_ADCPSC_Pos) | (((x) >> 2) << RCU_CFG0_ADCPSC_2_Pos))
#define RCU_CFG0_ADCPSC_DIV2           RCU_CFG0_ADCPSC(0)      /*!< ADC prescaler select CK_APB2/2 */
#define RCU_CFG0_ADCPSC_DIV4           RCU_CFG0_ADCPSC(1)      /*!< ADC prescaler select CK_APB2/4 */
#define RCU_CFG0_ADCPSC_DIV6           RCU_CFG0_ADCPSC(2)      /*!< ADC prescaler select CK_APB2/6 */
#define RCU_CFG0_ADCPSC_DIV8           RCU_CFG0_ADCPSC(3)      /*!< ADC prescaler select CK_APB2/8 */
#define RCU_CFG0_ADCPSC_DIV12          RCU_CFG0_ADCPSC(5)      /*!< ADC prescaler select CK_APB2/12 */
#define RCU_CFG0_ADCPSC_DIV16          RCU_CFG0_ADCPSC(7)      /*!< ADC prescaler select CK_APB2/16 */
#define RCU_CFG0_APB2PSC_Pos           11
#define RCU_CFG0_APB2PSC_Msk           _AC(0x00003800,U)       /*!< APB2 prescaler selection */
#define RCU_CFG0_APB2PSC(x)            ((x) << RCU_CFG0_APB2PSC_Pos)
#define RCU_CFG0_APB2PSC_DIV1          RCU_CFG0_APB2PSC(0)     /*!< APB2 prescaler select CK_AHB */
#define RCU_CFG0_APB2PSC_DIV2          RCU_CFG0_APB2PSC(4)     /*!< APB2 prescaler select CK_AHB/2 */
#define RCU_CFG0_APB2PSC_DIV4          RCU_CFG0_APB2PSC(5)     /*!< APB2 prescaler select CK_AHB/4 */
#define RCU_CFG0_APB2PSC_DIV8          RCU_CFG0_APB2PSC(6)     /*!< APB2 prescaler select CK_AHB/8 */
#define RCU_CFG0_APB2PSC_DIV16         RCU_CFG0_APB2PSC(7)     /*!< APB2 prescaler select CK_AHB/16 */
#define RCU_CFG0_APB1PSC_Pos           8
#define RCU_CFG0_APB1PSC_Msk           _AC(0x00000700,U)       /*!< APB1 prescaler selection */
#define RCU_CFG0_APB1PSC(x)            ((x) << RCU_CFG0_APB1PSC_Pos)
#define RCU_CFG0_APB1PSC_DIV1          RCU_CFG0_APB1PSC(0)     /*!< APB1 prescaler select CK_AHB */
#define RCU_CFG0_APB1PSC_DIV2          RCU_CFG0_APB1PSC(4)     /*!< APB1 prescaler select CK_AHB/2 */
#define RCU_CFG0_APB1PSC_DIV4          RCU_CFG0_APB1PSC(5)     /*!< APB1 prescaler select CK_AHB/4 */
#define RCU_CFG0_APB1PSC_DIV8          RCU_CFG0_APB1PSC(6)     /*!< APB1 prescaler select CK_AHB/8 */
#define RCU_CFG0_APB1PSC_DIV16         RCU_CFG0_APB1PSC(7)     /*!< APB1 prescaler select CK_AHB/16 */
#define RCU_CFG0_AHBPSC_Pos            4
#define RCU_CFG0_AHBPSC_Msk            _AC(0x000000f0,U)       /*!< AHB prescaler selection */
#define RCU_CFG0_AHBPSC(x)             ((x) << RCU_CFG0_AHBPSC_Pos)
#define RCU_CFG0_AHBPSC_DIV1           RCU_CFG0_AHBPSC(0)      /*!< AHB prescaler select CK_SYS */
#define RCU_CFG0_AHBPSC_DIV2           RCU_CFG0_AHBPSC(8)      /*!< AHB prescaler select CK_SYS/2 */
#define RCU_CFG0_AHBPSC_DIV4           RCU_CFG0_AHBPSC(9)      /*!< AHB prescaler select CK_SYS/4 */
#define RCU_CFG0_AHBPSC_DIV8           RCU_CFG0_AHBPSC(10)     /*!< AHB prescaler select CK_SYS/8 */
#define RCU_CFG0_AHBPSC_DIV16          RCU_CFG0_AHBPSC(11)     /*!< AHB prescaler select CK_SYS/16 */
#define RCU_CFG0_AHBPSC_DIV64          RCU_CFG0_AHBPSC(12)     /*!< AHB prescaler select CK_SYS/64 */
#define RCU_CFG0_AHBPSC_DIV128         RCU_CFG0_AHBPSC(13)     /*!< AHB prescaler select CK_SYS/128 */
#define RCU_CFG0_AHBPSC_DIV256         RCU_CFG0_AHBPSC(14)     /*!< AHB prescaler select CK_SYS/256 */
#define RCU_CFG0_AHBPSC_DIV512         RCU_CFG0_AHBPSC(15)     /*!< AHB prescaler select CK_SYS/512 */
#define RCU_CFG0_SCSS_Pos              2
#define RCU_CFG0_SCSS_Msk              _AC(0x0000000c,U)       /*!< system clock switch status */
#define RCU_CFG0_SCSS(x)               ((x) << RCU_CFG0_SCSS_Pos)
#define RCU_CFG0_SCSS_IRC8M            RCU_CFG0_SCSS(0)        /*!< system clock source select IRC8M */
#define RCU_CFG0_SCSS_HXTAL            RCU_CFG0_SCSS(1)        /*!< system clock source select HXTAL */
#define RCU_CFG0_SCSS_PLL              RCU_CFG0_SCSS(2)        /*!< system clock source select PLLP */
#define RCU_CFG0_SCS_Pos               0
#define RCU_CFG0_SCS_Msk               _AC(0x00000003,U)       /*!< system clock switch */
#define RCU_CFG0_SCS(x)                ((x) << RCU_CFG0_SCS_Pos)
#define RCU_CFG0_SCS_IRC8M             RCU_CFG0_SCS(0)         /*!< system clock source select IRC8M */
#define RCU_CFG0_SCS_HXTAL             RCU_CFG0_SCS(1)         /*!< system clock source select HXTAL */
#define RCU_CFG0_SCS_PLL               RCU_CFG0_SCS(2)         /*!< system clock source select PLL */

/* RCU_INT */
#define RCU_INT_CKMIC                  _BIT(23,U)              /*!< HXTAL clock stuck interrupt clear */
#define RCU_INT_PLL2STBIC              _BIT(22,U)              /*!< PLL2 stabilization interrupt clear */
#define RCU_INT_PLL1STBIC              _BIT(21,U)              /*!< PLL1 stabilization interrupt clear */
#define RCU_INT_PLLSTBIC               _BIT(20,U)              /*!< PLL stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC             _BIT(19,U)              /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_IRC8MSTBIC             _BIT(18,U)              /*!< IRC8M stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC             _BIT(17,U)              /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC40KSTBIC            _BIT(16,U)              /*!< IRC40K stabilization interrupt clear */
#define RCU_INT_PLL2STBIE              _BIT(14,U)              /*!< PLL2 stabilization interrupt enable */
#define RCU_INT_PLL1STBIE              _BIT(13,U)              /*!< PLL1 stabilization interrupt enable */
#define RCU_INT_PLLSTBIE               _BIT(12,U)              /*!< PLL stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE             _BIT(11,U)              /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_IRC8MSTBIE             _BIT(10,U)              /*!< IRC8M stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE             _BIT(9,U)               /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC40KSTBIE            _BIT(8,U)               /*!< IRC40K stabilization interrupt enable */
#define RCU_INT_CKMIF                  _BIT(7,U)               /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_PLL2STBIF              _BIT(6,U)               /*!< PLL2 stabilization interrupt flag */
#define RCU_INT_PLL1STBIF              _BIT(5,U)               /*!< PLL1 stabilization interrupt flag */
#define RCU_INT_PLLSTBIF               _BIT(4,U)               /*!< PLL stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF             _BIT(3,U)               /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_IRC8MSTBIF             _BIT(2,U)               /*!< IRC8M stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF             _BIT(1,U)               /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC40KSTBIF            _BIT(0,U)               /*!< IRC40K stabilization interrupt flag */

/* RCU_APB2RST */
#define RCU_APB2RST_USART0RST          _BIT(14,U)              /*!< USART0 reset */
#define RCU_APB2RST_SPI0RST            _BIT(12,U)              /*!< SPI0 reset */
#define RCU_APB2RST_TIMER0RST          _BIT(11,U)              /*!< TIMER0 reset */
#define RCU_APB2RST_ADC1RST            _BIT(10,U)              /*!< ADC1 reset */
#define RCU_APB2RST_ADC0RST            _BIT(9,U)               /*!< ADC0 reset */
#define RCU_APB2RST_PERST              _BIT(6,U)               /*!< GPIO port E reset */
#define RCU_APB2RST_PDRST              _BIT(5,U)               /*!< GPIO port D reset */
#define RCU_APB2RST_PCRST              _BIT(4,U)               /*!< GPIO port C reset */
#define RCU_APB2RST_PBRST              _BIT(3,U)               /*!< GPIO port B reset */
#define RCU_APB2RST_PARST              _BIT(2,U)               /*!< GPIO port A reset */
#define RCU_APB2RST_AFRST              _BIT(0,U)               /*!< alternate function I/O reset */

/* RCU_APB1RST */
#define RCU_APB1RST_DACRST             _BIT(29,U)              /*!< DAC reset */
#define RCU_APB1RST_PMURST             _BIT(28,U)              /*!< PMU reset */
#define RCU_APB1RST_BKPIRST            _BIT(27,U)              /*!< backup interface reset */
#define RCU_APB1RST_CAN1RST            _BIT(26,U)              /*!< CAN1 reset */
#define RCU_APB1RST_CAN0RST            _BIT(25,U)              /*!< CAN0 reset */
#define RCU_APB1RST_I2C1RST            _BIT(22,U)              /*!< I2C1 reset */
#define RCU_APB1RST_I2C0RST            _BIT(21,U)              /*!< I2C0 reset */
#define RCU_APB1RST_UART4RST           _BIT(20,U)              /*!< UART4 reset */
#define RCU_APB1RST_UART3RST           _BIT(19,U)              /*!< UART3 reset */
#define RCU_APB1RST_USART2RST          _BIT(18,U)              /*!< USART2 reset */
#define RCU_APB1RST_USART1RST          _BIT(17,U)              /*!< USART1 reset */
#define RCU_APB1RST_SPI2RST            _BIT(15,U)              /*!< SPI2 reset */
#define RCU_APB1RST_SPI1RST            _BIT(14,U)              /*!< SPI1 reset */
#define RCU_APB1RST_WWDGTRST           _BIT(11,U)              /*!< WWDGT reset */
#define RCU_APB1RST_TIMER6RST          _BIT(5,U)               /*!< TIMER6 reset */
#define RCU_APB1RST_TIMER5RST          _BIT(4,U)               /*!< TIMER5 reset */
#define RCU_APB1RST_TIMER4RST          _BIT(3,U)               /*!< TIMER4 reset */
#define RCU_APB1RST_TIMER3RST          _BIT(2,U)               /*!< TIMER3 reset */
#define RCU_APB1RST_TIMER2RST          _BIT(1,U)               /*!< TIMER2 reset */
#define RCU_APB1RST_TIMER1RST          _BIT(0,U)               /*!< TIMER1 reset */

