esmil/gd32vf103inator/include/gd32vf103/rcu.h
/* RCU_AHBEN */
#define RCU_AHBEN_USBFSEN              _BIT(12,U)              /*!< USBFS clock enable */
#define RCU_AHBEN_EXMCEN               _BIT(8,U)               /*!< EXMC clock enable */
#define RCU_AHBEN_CRCEN                _BIT(6,U)               /*!< CRC clock enable */
#define RCU_AHBEN_FMCSPEN              _BIT(4,U)               /*!< FMC clock enable when sleep mode */
#define RCU_AHBEN_SRAMSPEN             _BIT(2,U)               /*!< SRAM clock enable when sleep mode */
#define RCU_AHBEN_DMA1EN               _BIT(1,U)               /*!< DMA1 clock enable */
#define RCU_AHBEN_DMA0EN               _BIT(0,U)               /*!< DMA0 clock enable */

/* RCU_APB2EN */
#define RCU_APB2EN_USART0EN            _BIT(14,U)              /*!< USART0 clock enable */
#define RCU_APB2EN_SPI0EN              _BIT(12,U)              /*!< SPI0 clock enable */
#define RCU_APB2EN_TIMER0EN            _BIT(11,U)              /*!< TIMER0 clock enable */
#define RCU_APB2EN_ADC1EN              _BIT(10,U)              /*!< ADC1 clock enable */
#define RCU_APB2EN_ADC0EN              _BIT(9,U)               /*!< ADC0 clock enable */
#define RCU_APB2EN_PEEN                _BIT(6,U)               /*!< GPIO port E clock enable */
#define RCU_APB2EN_PDEN                _BIT(5,U)               /*!< GPIO port D clock enable */
#define RCU_APB2EN_PCEN                _BIT(4,U)               /*!< GPIO port C clock enable */
#define RCU_APB2EN_PBEN                _BIT(3,U)               /*!< GPIO port B clock enable */
#define RCU_APB2EN_PAEN                _BIT(2,U)               /*!< GPIO port A clock enable */
#define RCU_APB2EN_AFEN                _BIT(0,U)               /*!< alternate function IO clock enable */

/* RCU_APB1EN */
#define RCU_APB1EN_DACEN               _BIT(29,U)              /*!< DAC clock enable */
#define RCU_APB1EN_PMUEN               _BIT(28,U)              /*!< PMU clock enable */
#define RCU_APB1EN_BKPIEN              _BIT(27,U)              /*!< backup interface clock enable */
#define RCU_APB1EN_CAN1EN              _BIT(26,U)              /*!< CAN1 clock enable */
#define RCU_APB1EN_CAN0EN              _BIT(25,U)              /*!< CAN0 clock enable */
#define RCU_APB1EN_I2C1EN              _BIT(22,U)              /*!< I2C1 clock enable */
#define RCU_APB1EN_I2C0EN              _BIT(21,U)              /*!< I2C0 clock enable */
#define RCU_APB1EN_UART4EN             _BIT(20,U)              /*!< UART4 clock enable */
#define RCU_APB1EN_UART3EN             _BIT(19,U)              /*!< UART3 clock enable */
#define RCU_APB1EN_USART2EN            _BIT(18,U)              /*!< USART2 clock enable */
#define RCU_APB1EN_USART1EN            _BIT(17,U)              /*!< USART1 clock enable */
#define RCU_APB1EN_SPI2EN              _BIT(15,U)              /*!< SPI2 clock enable */
#define RCU_APB1EN_SPI1EN              _BIT(14,U)              /*!< SPI1 clock enable */
#define RCU_APB1EN_WWDGTEN             _BIT(11,U)              /*!< WWDGT clock enable */
#define RCU_APB1EN_TIMER6EN            _BIT(5,U)               /*!< TIMER6 clock enable */
#define RCU_APB1EN_TIMER5EN            _BIT(4,U)               /*!< TIMER5 clock enable */
#define RCU_APB1EN_TIMER4EN            _BIT(3,U)               /*!< TIMER4 clock enable */
#define RCU_APB1EN_TIMER3EN            _BIT(2,U)               /*!< TIMER3 clock enable */
#define RCU_APB1EN_TIMER2EN            _BIT(1,U)               /*!< TIMER2 clock enable */
#define RCU_APB1EN_TIMER1EN            _BIT(0,U)               /*!< TIMER1 clock enable */

/* RCU_BDCTL */
#define RCU_BDCTL_BKPRST               _BIT(16,U)              /*!< backup domain reset */
#define RCU_BDCTL_RTCEN                _BIT(15,U)              /*!< RTC clock enable */
#define RCU_BDCTL_RTCSRC_Pos           8
#define RCU_BDCTL_RTCSRC_Msk           _AC(0x00000300,U)       /*!< RTC clock entry selection */
#define RCU_BDCTL_RTCSRC(x)            ((x) << RCU_BDCTL_RTCSRC_Pos)
#define RCU_BDCTL_RTCSRC_NONE          RCU_BDCTL_RTCSRC(0)     /*!< no clock selected */
#define RCU_BDCTL_RTCSRC_LXTAL         RCU_BDCTL_RTCSRC(1)     /*!< RTC source clock select LXTAL  */
#define RCU_BDCTL_RTCSRC_IRC40K        RCU_BDCTL_RTCSRC(2)     /*!< RTC source clock select IRC40K */
#define RCU_BDCTL_RTCSRC_HXTAL_DIV_128 RCU_BDCTL_RTCSRC(3)     /*!< RTC source clock select HXTAL/128 */
#define RCU_BDCTL_LXTALBPS             _BIT(2,U)               /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALSTB             _BIT(1,U)               /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALEN              _BIT(0,U)               /*!< LXTAL enable */

/* RCU_RSTSCK */
#define RCU_RSTSCK_LPRSTF              _BIT(31,U)              /*!< low-power reset flag */
#define RCU_RSTSCK_WWDGTRSTF           _BIT(30,U)              /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_FWDGTRSTF           _BIT(29,U)              /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_SWRSTF              _BIT(28,U)              /*!< software reset flag */
#define RCU_RSTSCK_PORRSTF             _BIT(27,U)              /*!< power reset flag */
#define RCU_RSTSCK_EPRSTF              _BIT(26,U)              /*!< external pin reset flag */
#define RCU_RSTSCK_RSTFC               _BIT(24,U)              /*!< reset flag clear */
#define RCU_RSTSCK_IRC40KSTB           _BIT(1,U)               /*!< IRC40K stabilization flag */
#define RCU_RSTSCK_IRC40KEN            _BIT(0,U)               /*!< IRC40K enable */

/* RCU_AHBRST */
#define RCU_AHBRST_USBFSRST            _BIT(12,U)              /*!< USBFS reset */

/* RCU_CFG1 */
#define RCU_CFG1_I2S2SEL               _BIT(18,U)              /*!< I2S2 clock source selection  */
#define RCU_CFG1_I2S1SEL               _BIT(17,U)              /*!< I2S1 clock source selection */
#define RCU_CFG1_PREDV0SEL             _BIT(16,U)              /*!< PREDV0 input clock source selection */
#define RCU_CFG1_PLL2MF_Pos            12
#define RCU_CFG1_PLL2MF_Msk            _AC(0x0000f000,U)       /*!< PLL2 clock multiplication factor */
#define RCU_CFG1_PLL2MF(x)             ((x) << RCU_CFG1_PLL2MF_Pos)
#define RCU_CFG1_PLL2MF_MUL8           RCU_CFG1_PLL2MF(6)      /*!< PLL2 source clock multiply by 8 */
#define RCU_CFG1_PLL2MF_MUL9           RCU_CFG1_PLL2MF(7)      /*!< PLL2 source clock multiply by 9 */
#define RCU_CFG1_PLL2MF_MUL10          RCU_CFG1_PLL2MF(8)      /*!< PLL2 source clock multiply by 10 */
#define RCU_CFG1_PLL2MF_MUL11          RCU_CFG1_PLL2MF(9)      /*!< PLL2 source clock multiply by 11 */
#define RCU_CFG1_PLL2MF_MUL12          RCU_CFG1_PLL2MF(10)     /*!< PLL2 source clock multiply by 12 */
#define RCU_CFG1_PLL2MF_MUL13          RCU_CFG1_PLL2MF(11)     /*!< PLL2 source clock multiply by 13 */
#define RCU_CFG1_PLL2MF_MUL14          RCU_CFG1_PLL2MF(12)     /*!< PLL2 source clock multiply by 14 */
#define RCU_CFG1_PLL2MF_MUL15          RCU_CFG1_PLL2MF(13)     /*!< PLL2 source clock multiply by 15 */
#define RCU_CFG1_PLL2MF_MUL16          RCU_CFG1_PLL2MF(14)     /*!< PLL2 source clock multiply by 16 */
#define RCU_CFG1_PLL2MF_MUL20          RCU_CFG1_PLL2MF(15)     /*!< PLL2 source clock multiply by 20 */
#define RCU_CFG1_PLL1MF_Pos            8
#define RCU_CFG1_PLL1MF_Msk            _AC(0x00000f00,U)       /*!< PLL1 clock multiplication factor */
#define RCU_CFG1_PLL1MF(x)             ((x) << RCU_CFG1_PLL1MF_Pos)
#define RCU_CFG1_PLL1MF_MUL8           RCU_CFG1_PLL1MF(6)      /*!< PLL1 source clock multiply by 8 */
#define RCU_CFG1_PLL1MF_MUL9           RCU_CFG1_PLL1MF(7)      /*!< PLL1 source clock multiply by 9 */
#define RCU_CFG1_PLL1MF_MUL10          RCU_CFG1_PLL1MF(8)      /*!< PLL1 source clock multiply by 10 */
#define RCU_CFG1_PLL1MF_MUL11          RCU_CFG1_PLL1MF(9)      /*!< PLL1 source clock multiply by 11 */
#define RCU_CFG1_PLL1MF_MUL12          RCU_CFG1_PLL1MF(10)     /*!< PLL1 source clock multiply by 12 */
#define RCU_CFG1_PLL1MF_MUL13          RCU_CFG1_PLL1MF(11)     /*!< PLL1 source clock multiply by 13 */
#define RCU_CFG1_PLL1MF_MUL14          RCU_CFG1_PLL1MF(12)     /*!< PLL1 source clock multiply by 14 */
#define RCU_CFG1_PLL1MF_MUL15          RCU_CFG1_PLL1MF(13)     /*!< PLL1 source clock multiply by 15 */
#define RCU_CFG1_PLL1MF_MUL16          RCU_CFG1_PLL1MF(14)     /*!< PLL1 source clock multiply by 16 */
#define RCU_CFG1_PLL1MF_MUL20          RCU_CFG1_PLL1MF(15)     /*!< PLL1 source clock multiply by 20 */
#define RCU_CFG1_PREDV1_Pos            4
#define RCU_CFG1_PREDV1_Msk            _AC(0x000000f0,U)       /*!< PREDV1 division factor */
#define RCU_CFG1_PREDV1(x)             ((x) << RCU_CFG1_PREDV1_Pos)
#define RCU_CFG1_PREDV1_DIV1           RCU_CFG1_PREDV1(0)      /*!< PREDV1 input source clock not divided */
#define RCU_CFG1_PREDV1_DIV2           RCU_CFG1_PREDV1(1)      /*!< PREDV1 input source clock divided by 2 */
#define RCU_CFG1_PREDV1_DIV3           RCU_CFG1_PREDV1(2)      /*!< PREDV1 input source clock divided by 3 */
#define RCU_CFG1_PREDV1_DIV4           RCU_CFG1_PREDV1(3)      /*!< PREDV1 input source clock divided by 4 */
#define RCU_CFG1_PREDV1_DIV5           RCU_CFG1_PREDV1(4)      /*!< PREDV1 input source clock divided by 5 */
#define RCU_CFG1_PREDV1_DIV6           RCU_CFG1_PREDV1(5)      /*!< PREDV1 input source clock divided by 6 */
#define RCU_CFG1_PREDV1_DIV7           RCU_CFG1_PREDV1(6)      /*!< PREDV1 input source clock divided by 7 */
#define RCU_CFG1_PREDV1_DIV8           RCU_CFG1_PREDV1(7)      /*!< PREDV1 input source clock divided by 8 */
#define RCU_CFG1_PREDV1_DIV9           RCU_CFG1_PREDV1(8)      /*!< PREDV1 input source clock divided by 9 */
#define RCU_CFG1_PREDV1_DIV10          RCU_CFG1_PREDV1(9)      /*!< PREDV1 input source clock divided by 10 */
#define RCU_CFG1_PREDV1_DIV11          RCU_CFG1_PREDV1(10)     /*!< PREDV1 input source clock divided by 11 */
#define RCU_CFG1_PREDV1_DIV12          RCU_CFG1_PREDV1(11)     /*!< PREDV1 input source clock divided by 12 */
#define RCU_CFG1_PREDV1_DIV13          RCU_CFG1_PREDV1(12)     /*!< PREDV1 input source clock divided by 13 */
#define RCU_CFG1_PREDV1_DIV14          RCU_CFG1_PREDV1(13)     /*!< PREDV1 input source clock divided by 14 */
#define RCU_CFG1_PREDV1_DIV15          RCU_CFG1_PREDV1(14)     /*!< PREDV1 input source clock divided by 15 */
#define RCU_CFG1_PREDV1_DIV16          RCU_CFG1_PREDV1(15)     /*!< PREDV1 input source clock divided by 16 */
#define RCU_CFG1_PREDV0_Pos            0
#define RCU_CFG1_PREDV0_Msk            _AC(0x0000000f,U)       /*!< PREDV0 division factor */
#define RCU_CFG1_PREDV0(x)             ((x) << RCU_CFG1_PREDV0_Pos)
#define RCU_CFG1_PREDV0_DIV1           RCU_CFG1_PREDV0(0)      /*!< PREDV0 input source clock not divided */
#define RCU_CFG1_PREDV0_DIV2           RCU_CFG1_PREDV0(1)      /*!< PREDV0 input source clock divided by 2 */
#define RCU_CFG1_PREDV0_DIV3           RCU_CFG1_PREDV0(2)      /*!< PREDV0 input source clock divided by 3 */
#define RCU_CFG1_PREDV0_DIV4           RCU_CFG1_PREDV0(3)      /*!< PREDV0 input source clock divided by 4 */
#define RCU_CFG1_PREDV0_DIV5           RCU_CFG1_PREDV0(4)      /*!< PREDV0 input source clock divided by 5 */
#define RCU_CFG1_PREDV0_DIV6           RCU_CFG1_PREDV0(5)      /*!< PREDV0 input source clock divided by 6 */
#define RCU_CFG1_PREDV0_DIV7           RCU_CFG1_PREDV0(6)      /*!< PREDV0 input source clock divided by 7 */
#define RCU_CFG1_PREDV0_DIV8           RCU_CFG1_PREDV0(7)      /*!< PREDV0 input source clock divided by 8 */
#define RCU_CFG1_PREDV0_DIV9           RCU_CFG1_PREDV0(8)      /*!< PREDV0 input source clock divided by 9 */
#define RCU_CFG1_PREDV0_DIV10          RCU_CFG1_PREDV0(9)      /*!< PREDV0 input source clock divided by 10 */
#define RCU_CFG1_PREDV0_DIV11          RCU_CFG1_PREDV0(10)     /*!< PREDV0 input source clock divided by 11 */
#define RCU_CFG1_PREDV0_DIV12          RCU_CFG1_PREDV0(11)     /*!< PREDV0 input source clock divided by 12 */
#define RCU_CFG1_PREDV0_DIV13          RCU_CFG1_PREDV0(12)     /*!< PREDV0 input source clock divided by 13 */
#define RCU_CFG1_PREDV0_DIV14          RCU_CFG1_PREDV0(13)     /*!< PREDV0 input source clock divided by 14 */
#define RCU_CFG1_PREDV0_DIV15          RCU_CFG1_PREDV0(14)     /*!< PREDV0 input source clock divided by 15 */
#define RCU_CFG1_PREDV0_DIV16          RCU_CFG1_PREDV0(15)     /*!< PREDV0 input source clock divided by 16 */

/* RCU_DSV */
#define RCU_DSV_DSLPVS_Pos             0
#define RCU_DSV_DSLPVS_Msk             _AC(0x00000003,U)       /*!< deep-sleep mode voltage select */
#define RCU_DSV_DSLPVS(x)              ((x) << RCU_DSV_DSLPVS_Pos)
#define RCU_DSV_DSLPVS_1_2             RCU_DSV_DSLPVS(0)       /*!< core voltage is 1.2V in deep-sleep mode */
#define RCU_DSV_DSLPVS_1_1             RCU_DSV_DSLPVS(1)       /*!< core voltage is 1.1V in deep-sleep mode */
#define RCU_DSV_DSLPVS_1_0             RCU_DSV_DSLPVS(2)       /*!< core voltage is 1.0V in deep-sleep mode */
#define RCU_DSV_DSLPVS_0_9             RCU_DSV_DSLPVS(3)       /*!< core voltage is 0.9V in deep-sleep mode */

#ifndef __ASSEMBLER__
#include <stdint.h>

struct gd32vf103_rcu {
	volatile uint32_t CTL;
	volatile uint32_t CFG0;
	volatile uint32_t INT;
	volatile uint32_t APB2RST;
	volatile uint32_t APB1RST;
	volatile uint32_t AHBEN;
	volatile uint32_t APB2EN;
	volatile uint32_t APB1EN;
	volatile uint32_t BDCTL;
	volatile uint32_t RSTSCK;
	volatile uint32_t AHBRST;
	volatile uint32_t CFG1;
	uint32_t reserved1;
	volatile uint32_t DSV;
};

static struct gd32vf103_rcu *const RCU = (struct gd32vf103_rcu *)RCU_BASE;

#endif
#endif
